tests/executions/TNL/load.yaml
modules:
  blazemeter:
    token: 2cadfd52479c951654444fbd:e2323ba0be966df81cf836d5ea652fc1f9b9191002af0cc950d953d526a52e5bf09a50c6

execution:
  - executor: jmeter
    scenario: Style play load test
    concurrency: 5    # number of Virtual users
    throughput: 1        # max rps
    # iterations : 1
    ramp-up: 1m
    hold-for: 10m

reporting: 
- module: blazemeter
  report-name: Style play load test report-Pre metrics
  test: Taurus test
  project: Style play load test project
# - module: console
# - module: final-stats
#   summary: true  # overall samples count and percent of failures
#   percentiles: true  # display average times and percentiles
#   failed-labels: false  # provides list of sample labels with failures
#   test-duration: true  # provides test duration
#   dump-csv: TaurusResult/perf_result_csv.csv
# - module: passfail
#   criteria:
#   - avg-rt>150ms, stop as failed
#   - failures>10%

included-configs:
  - scenarios/styleplayloadtest.yaml